# Assignment 5: Pandas - Data Analysis of IMDB movies data

##Sagar Matur
GO_STP_6290

In [ ]:
import pandas as pd

1. Load and Read the IMDB dataset

In [ ]:
df=pd.read_csv('/content/IMDB-Movie-Data.csv')

2. View the Dataset

In [ ]:
df.head(10) #Prints first 10 observations

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0
5     6           The Great Wall  ...              45.13      42.0
6     7               La La Land  ...             151.06      93.0
7     8                 Mindhorn  ...                NaN      71.0
8     9       The Lost City of Z  ...               8.01      78.0
9    10               Passengers  ...             100.01      41.0

[10 rows x 12 columns]

In [ ]:
df.tail(10) #Prints last 10 observations

     Rank                           Title  ... Revenue (Millions) Metascore
990   991  Underworld: Rise of the Lycans  ...              45.80      44.0
991   992                Taare Zameen Par  ...               1.20      42.0
992   993            Take Me Home Tonight  ...               6.92       NaN
993   994        Resident Evil: Afterlife  ...              60.13      37.0
994   995                       Project X  ...              54.72      48.0
995   996            Secret in Their Eyes  ...                NaN      45.0
996   997                 Hostel: Part II  ...              17.54      46.0
997   998          Step Up 2: The Streets  ...              58.01      50.0
998   999                    Search Party  ...                NaN      22.0
999  1000                      Nine Lives  ...              19.64      11.0

[10 rows x 12 columns]

3.	Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [ ]:
df.columns #returns the column names of IMDB dataset

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [ ]:
df.shape 
#The IMDB dataset contains 1000 observations and 12 variables

(1000, 12)

In [ ]:
df.dtypes #This returns the data types of each variable

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [ ]:
df.describe() 
#This returns basic statistics of numerical columns

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

4.	Data Selection – Indexing and Slicing data

In [ ]:
df[['Title', 'Year']]

                       Title  Year
0    Guardians of the Galaxy  2014
1                 Prometheus  2012
2                      Split  2016
3                       Sing  2016
4              Suicide Squad  2016
..                       ...   ...
995     Secret in Their Eyes  2015
996          Hostel: Part II  2007
997   Step Up 2: The Streets  2008
998             Search Party  2014
999               Nine Lives  2016

[1000 rows x 2 columns]

In [ ]:
df.iloc[500:1001, 6]        
#.iloc helps to select the rows and columns by their position

500    2015
501    2015
502    2016
503    2015
504    2009
       ...
995    2015
996    2007
997    2008
998    2014
999    2016
Name: Year, Length: 500, dtype: int64

In [ ]:
df.loc[500:1001, 'Year']
#.iloc helps to select the rows and columns by their label

500    2015
501    2015
502    2016
503    2015
504    2009
       ...
995    2015
996    2007
997    2008
998    2014
999    2016
Name: Year, Length: 500, dtype: int64

5.	Data Selection – Based on Conditional filtering

In [ ]:
df[df['Rating'] >= 8.0]

     Rank                     Title  ... Revenue (Millions) Metascore
0       1   Guardians of the Galaxy  ...             333.13      76.0
6       7                La La Land  ...             151.06      93.0
16     17             Hacksaw Ridge  ...              67.12      71.0
18     19                      Lion  ...              51.69      69.0
19     20                   Arrival  ...             100.50      81.0
..    ...                       ...  ...                ...       ...
742   743    El secreto de sus ojos  ...              20.17      80.0
765   766                        PK  ...              10.57      51.0
772   773  How to Train Your Dragon  ...             217.39      74.0
861   862            Koe no katachi  ...                NaN      80.0
991   992          Taare Zameen Par  ...               1.20      42.0

[78 rows x 12 columns]

In [ ]:
df[df['Revenue (Millions)'] >= 100.0].sort_values('Revenue (Millions)', ascending=False)

     Rank  ... Metascore
50     51  ...      81.0
87     88  ...      83.0
85     86  ...      59.0
76     77  ...      69.0
54     55  ...      82.0
..    ...  ...       ...
19     20  ...      81.0
360   361  ...      51.0
200   201  ...      71.0
837   838  ...      54.0
9      10  ...      41.0

[250 rows x 12 columns]

6.	Groupby operations

In [ ]:
df.groupby('Genre', sort=True)[['Rank']].count()

                            Rank
Genre
Action                         2
Action,Adventure               3
Action,Adventure,Biography     2
Action,Adventure,Comedy       14
Action,Adventure,Crime         6
...                          ...
Romance,Sci-Fi,Thriller        1
Sci-Fi                         2
Sci-Fi,Thriller                1
Thriller                       9
Thriller,War                   1

[207 rows x 1 columns]

In [ ]:
df.groupby('Year', sort=True)[['Rank']].count()

      Rank
Year
2006    44
2007    53
2008    52
2009    51
2010    60
2011    63
2012    64
2013    91
2014    98
2015   127
2016   297

In [ ]:
df.groupby('Director', sort=True)[['Rating']].mean()

                     Rating
Director
Aamir Khan             8.50
Abdellatif Kechiche    7.80
Adam Leon              6.50
Adam McKay             7.00
Adam Shankman          6.30
...                     ...
Xavier Dolan           7.55
Yimou Zhang            6.10
Yorgos Lanthimos       7.20
Zack Snyder            7.04
Zackary Adler          5.10

[644 rows x 1 columns]

In [ ]:
grp = df.groupby('Year')['Rank']
grp.count()

Year
2006     44
2007     53
2008     52
2009     51
2010     60
2011     63
2012     64
2013     91
2014     98
2015    127
2016    297
Name: Rank, dtype: int64

In [ ]:
#Average movie rating for different directors
dr=df.groupby('Director')['Rating']
dr.mean().sort_values(ascending=False)

Director
Nitesh Tiwari        8.80
Christopher Nolan    8.68
Makoto Shinkai       8.60
Olivier Nakache      8.60
Aamir Khan           8.50
                     ...
Femi Oyeniran        3.50
Jonathan Holbrook    3.20
Shawn Burkett        2.70
James Wong           2.70
Jason Friedberg      1.90
Name: Rating, Length: 644, dtype: float64

7.	Sorting operation

In [ ]:
df.sort_values('Rating', ascending=False)

     Rank                    Title  ... Revenue (Millions) Metascore
54     55          The Dark Knight  ...             533.32      82.0
80     81                Inception  ...             292.57      74.0
117   118                   Dangal  ...              11.15       NaN
36     37             Interstellar  ...             187.99      74.0
96     97            Kimi no na wa  ...               4.68      79.0
..    ...                      ...  ...                ...       ...
968   969                  Wrecker  ...                NaN      37.0
647   648                 Tall Men  ...                NaN      57.0
871   872     Dragonball Evolution  ...               9.35      45.0
42     43  Don't Fuck in the Woods  ...                NaN       NaN
829   830           Disaster Movie  ...              14.17      15.0

[1000 rows x 12 columns]

8.	Dealing with missing values

In [ ]:
df.isna()
#This condition helps to check which cell contains missing value
#.isnull() function can also be used.

      Rank  Title  Genre  ...  Votes  Revenue (Millions)  Metascore
0    False  False  False  ...  False               False      False
1    False  False  False  ...  False               False      False
2    False  False  False  ...  False               False      False
3    False  False  False  ...  False               False      False
4    False  False  False  ...  False               False      False
..     ...    ...    ...  ...    ...                 ...        ...
995  False  False  False  ...  False                True      False
996  False  False  False  ...  False               False      False
997  False  False  False  ...  False               False      False
998  False  False  False  ...  False                True      False
999  False  False  False  ...  False               False      False

[1000 rows x 12 columns]

In [ ]:
df.isna().sum()
#This condition returns total number of missing values in each column
#.isnull() function can also be used.

Rank                   0
Title                  0
Genre                  0
Description            0
Director               0
Actors                 0
Year                   0
Runtime (Minutes)      0
Rating                 0
Votes                  0
Revenue (Millions)     0
Metascore             64
dtype: int64

In [ ]:
pd.isna(df["Metascore"]).sum() 
#This condition returns missing values for specified column

64

In [ ]:
# fill missing values with mean column values
df["Revenue (Millions)"].fillna(df["Revenue (Millions)"].mean(), inplace=True)

9.	Dropping columns and null values

In [ ]:
# drop rows with missing values
df.dropna(inplace=True)

In [ ]:
df.dropna(axis = 1)
#This command drops the column which contains atleast one null value (missing value).

10.	Apply( ) functions

In [ ]:
df.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [ ]:
#New dataframe which contains only numerical columns
df1 = df[['Rank', 'Year', 'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore']]
print(df1)

     Rank  Year  Runtime (Minutes)  ...   Votes  Revenue (Millions)  Metascore
0       1  2014                121  ...  757074          333.130000       76.0
1       2  2012                124  ...  485820          126.460000       65.0
2       3  2016                117  ...  157606          138.120000       62.0
3       4  2016                108  ...   60545          270.320000       59.0
4       5  2016                123  ...  393727          325.020000       40.0
..    ...   ...                ...  ...     ...                 ...        ...
995   996  2015                111  ...   27585           82.956376       45.0
996   997  2007                 94  ...   73152           17.540000       46.0
997   998  2008                 98  ...   70699           58.010000       50.0
998   999  2014                 93  ...    4881           82.956376       22.0
999  1000  2016                 87  ...   12435           19.640000       11.0

[936 rows x 7 columns]

In [ ]:
# Gather sum of all columns
df1.apply(sum, axis=0)

Rank                  4.663020e+05
Year                  1.883954e+06
Runtime (Minutes)     1.060230e+05
Rating                6.298500e+03
Votes                 1.640529e+08
Revenue (Millions)    7.899482e+04
Metascore             5.521000e+04
dtype: float64

In [ ]:
# Gather sum of all rows
df1.apply(sum, axis=1)

0      759627.230000
1      488156.460000
2      159949.420000
3       63009.520000
4      396242.220000
           ...
995     30841.156376
996     76319.040000
997     73917.210000
998      8097.556376
999     15573.940000
Length: 936, dtype: float64